from datetime import datetime, timedelta

def calculate_total_time(time_ranges):
    total_time = timedelta()
    for start_time, end_time in time_ranges:
        start = datetime.strptime(start_time, "%H:%M")
        end = datetime.strptime(end_time, "%H:%M")
        time_delta = end - start
        total_time += time_delta
    return total_time

time_ranges = [
    ("17:16", "18:37"),
    ("19:20", "20:45"),
    ("10:35", "11:15"),
    ("16:16", "17:38"),
    ("21:20", "21:42"),
    ("21:43", "21:56"),
    ("11:08", "11:37"),
    ("09:55", "11:24"),
    ("22:26", "22:54"),
    ("23:26", "23:56"),
    ("16:50", "17:50"),
    ("21:33", "22:44"),
    ("16:16", "18:32"),
    # ("23:47", "01:26"),
    ("09:42", "10:21"),
    ("10:43", "11:28"),
    ("22:04", "23:25"),
    ("11:53", "12:57"),
    ("13:14", "13:36"),  # Доделал базовый компонент вопроса
    ("13:36", "14:37"),  # Заполнение тестовых данных
    ("16:23", "17:11"),  # Загрузка тестовых данных
    ("17:11", "17:26"),
    ("19:19", "20:36"),
    ("20:54", "21:44"),  # Как резетить стейт когда приходит новый вопрос??
    ("09:54", "11:04"),
    ("10:26", "11:22"),  # Доделал summarized статистику на фронте и начал размечать detailed статистику
    ("09:22", "11:01"),  # Доделал detailed статистику
    ("08:09", "08:20")
    ("09:00", "10:29"),  # Разбирался с подключением к reg.ru хостингу (спойлер: не получилось, беды с фаерволом)
    ("10:32", "10:49"),  # Справился настроить ssh
    ("10:58", "12:58"),
    ("12:17", "12:23"),
    ("12:26", "12:36"),  # Вроде как-то минимально задеплоил
    ("12:53", "13:40"),  # Показ теста
    ("10:33", "11:42"),  # Раскидал бэковский код по модулям. Кучу времени потратил, чтобы настроить flask session в тестах, но безуспешно((
    ("09:11", "11:17"),  # Справился настроить flask session в тестах, сделал константы в тестах реюзабельными и сделал так, чтобы можно было все тесты одновременно запускать
]
total_time = calculate_total_time(time_ranges)
print(total_time)
